/*
* Copyright (c) 2015,Yuanjian
* All rights reserved.
*
* 文件名称：basic_rf.h
* 文件标识：
* 摘 要：
*
* 当前版本：0.0
* 作 者：   袁舰
* 完成日期：2015年7月17日
*
* 取代版本：
* 原作者:
* 完成日期：
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#ifndef BASIC_RF_H
#define BASIC_RF_H


/***********************************************************************************
* INCLUDES
*/
#include "types.h"


/***********************************************************************************
* CONSTANTS AND DEFINES
*/

#define BASIC_RF_PACKET_SIZE        25
#define RF_RX_FCS_SIZE              2
#define RF_MAX_RX_SIZE				27
// The length byte
#define PHY_PACKET_SIZE_MASK        0x7F

/***********************************************************************************
* TYPEDEFS
*/






/***********************************************************************************
* GLOBAL FUNCTIONS
*/
void basicRfInit(void);
void RF_RxModeOn(void);
void RF_RxModeOff(void);
void SetRFPwr(uint8 );
void ReceivedFrameDecode(void);
void Send( uint8 cmd);






/***********************************************************************************
  
***********************************************************************************/

#endif

